// Напишите программу, которая на вход принимает два числа и выдаёт,
// какое число большее, а какое меньшее

int numberA = int.Parse(Console.WriteLine());
int numberB = int.Parse(Console.WriteLine());

if(numberA < numberB)
{
    Console.WriteLine(numberB);
}
else
{
    Console.WriteLine(numberA);
}