// Напишите программу, которая принимает на вход три числа
// и выдаёт максимальное из этих чисел

int a = int.Parse(Console.ReadLine());
int b = int.Parse(Console.ReadLine());
int c = int.Parse(Console.ReadLine());

max = 0;

Console.WriteLine(max);
